Revit 2027 API
BuiltInFailures.StairRampFailures.AntiparallelRampRisers Property
 Riser lines are parallel but not collinear. Can't build Run between these Risers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AntiparallelRampRisers { get; }
Public Shared ReadOnly Property AntiparallelRampRisers As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AntiparallelRampRisers {
	FailureDefinitionId^ get ();
}
static member AntiparallelRampRisers : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace